src/Работа_С_Заказами/DataProcessors/ОтправленныеОповещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>ОтправленныеОповещения</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Работа_С_Заказами/InformationRegisters/ДанныеПоследнихОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПоследнихОповещений</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеПоследнегоОповещения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОповещения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОповещенийКлиентам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникОповещения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подписчик</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Работа_С_Заказами/DataProcessors/ОтправленныеОповещения/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокНаСервере();
	//ГруппаРассылокИОповещений =  Неопределено;
	//СтруктураНастроек = ХранилищеОбщихНастроек.Загрузить("Обработка.ОповещенияПриРаботеСЗаказами.Форма.Форма","СтруктураНастроек");
	//Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
	//	ТаблицаШаблонов = СтруктураНастроек.ТаблицаШаблонов;
	//	Если ТаблицаШаблонов.Количество() > 0 Тогда
	//		ГруппаРассылокИОповещений =  ТаблицаШаблонов[0].ГруппаРассылокИОповещений;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если ГруппаРассылокИОповещений =  Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ДанныеПоследнихОповещений.ВидОповещения КАК ВидОповещения,
	//	|	ДанныеПоследнихОповещений.ИсточникОповещения КАК ИсточникОповещения,
	//	|	ДанныеПоследнихОповещений.Подписчик КАК Подписчик,
	//	|	ДанныеПоследнихОповещений.ДанныеПоследнегоОповещения КАК ДанныеПоследнегоОповещения
	//	|ИЗ
	//	|	РегистрСведений.ДанныеПоследнихОповещений КАК ДанныеПоследнихОповещений
	//	|ГДЕ
	//	|	ДанныеПоследнихОповещений.ВидОповещения.ГруппаРассылокИОповещений = &ГруппаРассылокИОповещений";	
	//
	//Запрос.УстановитьПараметр("ГруппаРассылокИОповещений", ГруппаРассылокИОповещений);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	стр = Список.Добавить();
	//	стр.ВидОповещения = ВыборкаДетальныеЗаписи.ВидОповещения;
	//	стр.ЗаказКлиента = ВыборкаДетальныеЗаписи.ИсточникОповещения;
	//	стр.Партнер = ВыборкаДетальныеЗаписи.Подписчик;
	//	стр.ДатаОповещения = ВыборкаДетальныеЗаписи.ДанныеПоследнегоОповещения.Получить().Дата;
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокНаСервере()
	
	ГруппаРассылокИОповещений =  Неопределено;
	СтруктураНастроек = ХранилищеОбщихНастроек.Загрузить("Обработка.ОповещенияПриРаботеСЗаказами.Форма.Форма","СтруктураНастроек");
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		ТаблицаШаблонов = СтруктураНастроек.ТаблицаШаблонов;
		Если ТаблицаШаблонов.Количество() > 0 Тогда
			ГруппаРассылокИОповещений =  ТаблицаШаблонов[0].ГруппаРассылокИОповещений;
		КонецЕсли;
	КонецЕсли;
	
	Если ГруппаРассылокИОповещений =  Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПоследнихОповещений.ВидОповещения КАК ВидОповещения,
		|	ДанныеПоследнихОповещений.ИсточникОповещения КАК ИсточникОповещения,
		|	ДанныеПоследнихОповещений.Подписчик КАК Подписчик,
		|	ДанныеПоследнихОповещений.ДанныеПоследнегоОповещения КАК ДанныеПоследнегоОповещения
		|ИЗ
		|	РегистрСведений.ДанныеПоследнихОповещений КАК ДанныеПоследнихОповещений
		|ГДЕ
		|	ДанныеПоследнихОповещений.ВидОповещения.ГруппаРассылокИОповещений = &ГруппаРассылокИОповещений";	
	
	Запрос.УстановитьПараметр("ГруппаРассылокИОповещений", ГруппаРассылокИОповещений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		стр = Список.Добавить();
		стр.ВидОповещения = ВыборкаДетальныеЗаписи.ВидОповещения;
		стр.ЗаказКлиента = ВыборкаДетальныеЗаписи.ИсточникОповещения;
		стр.Партнер = ВыборкаДетальныеЗаписи.Подписчик;
		Попытка
			стр.ДатаОповещения = ВыборкаДетальныеЗаписи.ДанныеПоследнегоОповещения.Получить().Дата;
		Исключение
			стр.ДатаОповещения = стр.ЗаказКлиента.Дата;
		КонецПопытки;
	КонецЦикла;
	Список.Сортировать("ДатаОповещения УБЫВ");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПередУдалениемНаСервере(Заказ)

	//НЗ = РегистрыСведений.ДанныеПоследнихОповещений.СоздатьНаборЗаписей();
	//НЗ.Отбор.ИсточникОповещения.Установить(Заказ);
	//НЗ.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	//ТД = Элемент.ТекущиеДанные;
	//Если ТД = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//СписокПередУдалениемНаСервере(ТД.ЗаказКлиента);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	Список.Очистить();
	ЗаполнитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоУбыванию(Команда)
	Список.Сортировать("ДатаОповещения УБЫВ");
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоВозрастанию(Команда)
	Список.Сортировать("ДатаОповещения");
КонецПроцедуры
